<center style="font-size:48px;">Reading In the data</center>

In [2]:
import pandas as pd

In [4]:
gps = pd.read_csv('../Data/gps.csv', parse_dates=['Timestamp'])
gps.head()

            Timestamp  id        lat       long
0 2014-01-06 06:28:01  35  36.076225  24.874689
1 2014-01-06 06:28:01  35  36.076220  24.874596
2 2014-01-06 06:28:03  35  36.076211  24.874443
3 2014-01-06 06:28:05  35  36.076217  24.874253
4 2014-01-06 06:28:06  35  36.076214  24.874167

Dataset contains the tracking information (time, latatitude, longitude) for each car(id)

In [6]:
cc = pd.read_csv('../Data/cc_data.csv', encoding='cp1252')
cc.head()

       timestamp             location  price FirstName  LastName
0  1/6/2014 7:28  Brew've Been Served  11.34    Edvard      Vann
1  1/6/2014 7:34     Hallowed Grounds  52.22    Hideki  Cocinaro
2  1/6/2014 7:35  Brew've Been Served   8.33    Stenig     Fusil
3  1/6/2014 7:36     Hallowed Grounds  16.72  Birgitta    Frente
4  1/6/2014 7:37  Brew've Been Served   4.24      Sven    Flecha

Dataset contains purchases for the employees

In [7]:
cars = pd.read_csv('../Data/car-assignments.csv')
cars.head()

   LastName FirstName  CarID   CurrentEmploymentType CurrentEmploymentTitle
0   Alcazar     Lucas    1.0  Information Technology            IT Helpdesk
1     Azada      Lars    2.0             Engineering               Engineer
2     Balas     Felix    3.0             Engineering               Engineer
3  Barranco    Ingrid    4.0               Executive                SVP/CFO
4      Baza      Isak    5.0  Information Technology          IT Technician

Contains information on each employee susc as name, job, and car they are assigned to.

In [8]:
loyalty = pd.read_csv('../Data/loyalty_data.csv', encoding='cp1252')
loyalty.head()

  timestamp             location  price FirstName  LastName
0  1/6/2014  Brew've Been Served   4.17  Cornelia      Lais
1  1/6/2014  Brew've Been Served   9.60       Mat    Bramar
2  1/6/2014     Hallowed Grounds  16.53     Emile      Arpa
3  1/6/2014         Coffee Shack  11.51     Varro    Awelon
4  1/6/2014     Hallowed Grounds  12.93    Rachel  Pantanal

Dataset contains purchases for the employees. They differ from above in that they are loyalty card purchases.